<a href="https://colab.research.google.com/github/dubeyshubham786/Python_libraries/blob/main/Pandas_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Add remove rows and columns

In [ ]:
import pandas as pd

In [ ]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [ ]:
df = pd.DataFrame(people)

In [ ]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [ ]:
# Now suppose we want to add the column

df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [ ]:
# Add this to a new column

df['fullname'] = df['first'] + ' ' + df['last']

In [ ]:
df

   first     last                    email       fullname
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [ ]:
# Let's say we don't want this column
# We can remove it by applying drop method.

df.drop(columns = ['first', 'last'], inplace=True)

In [ ]:
df

                     email       fullname
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [ ]:
# We can split the full name column 

df['fullname'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: fullname, dtype: object

In [ ]:
# Now if we want to asign this to two different column we can do this by expand arguement

df['fullname'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [ ]:
# We want to add this column 

df[['first','last']] = df['fullname'].str.split(' ', expand=True)

In [ ]:
df

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [ ]:
# Add a single row

df.append({'first':'Tony'}, ignore_index=True)

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [ ]:
# Let's create a new dataframe

people = {
    "first": ["Tony", 'Steve'], 
    "last": ["Stark", 'Roger'], 
    "email": ["ironman@avengers.com", 'Cat@avenger.com']
}

In [ ]:
df2 = pd.DataFrame(people)

In [ ]:
df2

   first   last                 email
0   Tony  Stark  ironman@avengers.com
1  Steve  Roger       Cat@avenger.com

In [ ]:
# Now let's suppose that we want to append this two dataframe 

df.append(df2, ignore_index=True)

# if we want to make this changes permanent then unlike this drop method we don't have inplace method here.

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3     ironman@avengers.com            NaN   Tony    Stark
4          Cat@avenger.com            NaN  Steve    Roger

In [ ]:
df = df.append(df2, ignore_index=True)

In [ ]:
df

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3     ironman@avengers.com            NaN   Tony    Stark
4          Cat@avenger.com            NaN  Steve    Roger

In [ ]:
# Now let's look at removing rows

df.drop(index=4)

# Again if we want to apply this to our dataframe then we have to use inplace=True

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3     ironman@avengers.com            NaN   Tony    Stark

In [ ]:
# Now suppose if we want to drop all of the rows where last name is 'Doe'

df.drop(index=df[df['last'] == 'Doe'].index)

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3     ironman@avengers.com            NaN   Tony    Stark
4          Cat@avenger.com            NaN  Steve    Roger

In [ ]:
# but doing like this makes it unreadable instead we can do like this

filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email       fullname  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3     ironman@avengers.com            NaN   Tony    Stark
4          Cat@avenger.com            NaN  Steve    Roger